Ran Plan for dir: `2.platform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.6.6 plan -input=false -refresh -out \"/atlantis-data/repos/wangzitian0/infra/180/default/2.platform/platform-default.tfplan\"" in "/atlantis-data/repos/wangzitian0/infra/180/default/2.platform": exit status 1
random_id.kubero_session_secret: Refreshing state... [id=RVFIT6-_HmRjrBOsQK0aUH28Q1lIbvo4QPiPVbcf_5o]
random_password.portal_gate_client_secret[0]: Refreshing state... [id=none]
random_password.dashboard_oidc_client_secret[0]: Refreshing state... [id=none]
random_password.portal_cookie_secret[0]: Refreshing state... [id=none]
random_password.l3_postgres[0]: Refreshing state... [id=none]
random_password.kubero_oidc_client_secret[0]: Refreshing state... [id=none]
random_password.vault_oidc_client_secret[0]: Refreshing state... [id=none]
terraform_data.portal_sso_precheck: Refreshing state... [id=a912d9c3-6b86-ef7f-b2b4-f4e56f422964]
data.kubernetes_namespace.platform: Reading...
kubernetes_namespace.kubero_operator_system: Refreshing state... [id=kubero-operator-system]
data.cloudflare_zone.internal: Reading...
vault_mount.kv[0]: Refreshing state... [id=secret]
vault_mount.database[0]: Refreshing state... [id=database]
kubernetes_ingress_v1.vault: Refreshing state... [id=platform/vault-ingress]
data.kubernetes_namespace.platform: Read complete after 0s [id=platform]
kubernetes_service_account.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
kubernetes_config_map.casdoor_init_data[0]: Refreshing state... [id=platform/casdoor-init-data]
helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
helm_release.vault: Refreshing state... [id=vault]
kubectl_manifest.kubero_operator[47]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/configmaps/kubero-operator-manager-config]
kubectl_manifest.kubero_operator[6]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoapps.application.kubero.dev]
kubectl_manifest.kubero_operator[48]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/services/kubero-operator-controller-manager-metrics-service]
kubectl_manifest.kubero_operator[18]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoprometheuses.application.kubero.dev]
kubectl_manifest.kubero_operator[5]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonredis.application.kubero.dev]
kubectl_manifest.kubero_operator[44]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/rolebindings/kubero-operator-leader-election-rolebinding]
kubectl_manifest.kubero_operator[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-manager-role]
kubectl_manifest.kubero_operator[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-metrics-reader]
kubectl_manifest.kubero_operator[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-admin-role]
kubectl_manifest.kubero_operator[11]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberokafkas.application.kubero.dev]
kubectl_manifest.kubero_operator[26]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-admin-role]
kubectl_manifest.kubero_operator[34]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-viewer-role]
kubectl_manifest.kubero_operator[25]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-viewer-role]
kubectl_manifest.kubero_operator[35]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-admin-role]
kubectl_manifest.kubero_operator[45]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding]
kubectl_manifest.kubero_operator[28]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-viewer-role]
kubectl_manifest.kubero_operator[2]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmysqls.application.kubero.dev]
kubectl_manifest.kubero_operator[20]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoredis.application.kubero.dev]
kubectl_manifest.kubero_operator[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-viewer-role]
kubectl_manifest.kubero_operator[31]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-viewer-role]
kubectl_manifest.kubero_operator[30]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-editor-role]
kubectl_manifest.kubero_operator[10]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoes.application.kubero.dev]
kubectl_manifest.kubero_operator[12]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomails.application.kubero.dev]
kubectl_manifest.kubero_operator[4]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonrabbitmqs.application.kubero.dev]
kubectl_manifest.kubero_operator[16]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopipelines.application.kubero.dev]
kubectl_manifest.kubero_operator[8]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberocouchdbs.application.kubero.dev]
kubectl_manifest.kubero_operator[0]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmemcacheds.application.kubero.dev]
kubectl_manifest.kubero_operator[1]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmongodbs.application.kubero.dev]
kubectl_manifest.kubero_operator[29]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-admin-role]
kubectl_manifest.kubero_operator[49]: Refreshing state... [id=/apis/apps/v1/namespaces/kubero-operator-system/deployments/kubero-operator-controller-manager]
kubectl_manifest.kubero_operator[36]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-editor-role]
kubectl_manifest.kubero_operator[33]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-editor-role]
kubectl_manifest.kubero_operator[3]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonpostgres.application.kubero.dev]
kubectl_manifest.kubero_operator[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/roles/kubero-operator-leader-election-role]
kubectl_manifest.kubero_operator[24]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-editor-role]
kubectl_manifest.kubero_operator[7]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberobuilds.application.kubero.dev]
kubectl_manifest.kubero_operator[43]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-proxy-role]
kubectl_manifest.kubero_operator[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-editor-role]
kubectl_manifest.kubero_operator[23]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-admin-role]
kubectl_manifest.kubero_operator[32]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-admin-role]
kubectl_manifest.kubero_operator[17]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopostgresqls.application.kubero.dev]
kubectl_manifest.kubero_operator[13]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomemcacheds.application.kubero.dev]
kubectl_manifest.kubero_operator[14]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomongodbs.application.kubero.dev]
kubectl_manifest.kubero_operator[15]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomysqls.application.kubero.dev]
kubectl_manifest.kubero_operator[21]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/serviceaccounts/kubero-operator-controller-manager]
kubectl_manifest.kubero_operator[19]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberorabbitmqs.application.kubero.dev]
kubectl_manifest.kubero_operator[46]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding]
kubectl_manifest.kubero_operator[27]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-editor-role]
kubectl_manifest.kubero_operator[9]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoelasticsearches.application.kubero.dev]
kubectl_manifest.kubero_operator[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-viewer-role]
helm_release.casdoor[0]: Refreshing state... [id=casdoor]
kubernetes_namespace.kubero: Refreshing state... [id=kubero]
kubectl_manifest.kubero_instance: Refreshing state... [id=/apis/application.kubero.dev/v1alpha1/namespaces/kubero/kuberos/kubero]
data.cloudflare_zone.internal: Read complete after 1s [id=6e69310ba4000e47c0a2480e2606713a]
cloudflare_record.casdoor[0]: Refreshing state... [id=6e633a613fc5dabf084af15e7726b12a]
kubernetes_cluster_role_binding.dashboard_api_admin: Refreshing state... [id=kubernetes-dashboard-api-admin]
kubernetes_service_account.dashboard_admin: Refreshing state... [id=platform/dashboard-admin]
kubernetes_ingress_v1.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
kubernetes_cluster_role_binding.dashboard_admin: Refreshing state... [id=dashboard-admin]
kubernetes_secret.dashboard_admin_token: Refreshing state... [id=platform/dashboard-admin-token]
helm_release.portal_auth[0]: Refreshing state... [id=portal-auth]
kubernetes_manifest.portal_auth_middleware_platform[0]: Refreshing state...
kubernetes_manifest.portal_auth_middleware_kubero[0]: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # helm_release.casdoor[0] will be updated in-place
  ~ resource "helm_release" "casdoor" {
        id                         = "casdoor"
      ~ metadata                   = [
          - {
              - app_version    = "v1.570.0"
              - chart          = "casdoor-helm-charts"
              - first_deployed = 1765575849
              - last_deployed  = 1765659174
              - name           = "casdoor"
              - namespace      = "platform"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                      https://sso.zitian.party/
                EOT
              - revision       = 9
              - values         = jsonencode(
                    {
                      - config            = <<-EOT
                            appname = casdoor
                            httpport = 8000
                            origin = https://sso.zitian.party
                            staticBaseUrl = https://cdn.casbin.org
                            
                            # Required for Beego to parse request body (fixes "unexpected end of JSON input" login bug)
                            # Reference: https://github.com/casdoor/casdoor/issues/3224
                            copyrequestbody = true
                            
                            # Database configuration
                            driverName = postgres
                            dataSourceName = user=postgres password=Ld63FK25alvAwewa18YS85JMPwxzkt host=postgresql.platform.svc.cluster.local port=5432 dbname=casdoor sslmode=disable
                            dbName = casdoor
                        EOT
                      - extraVolumeMounts = [
                          - {
                              - mountPath = "/init_data.json"
                              - name      = "init-data"
                              - readOnly  = true
                              - subPath   = "init_data.json"
                            },
                        ]
                      - extraVolumes      = [
                          - {
                              - configMap = {
                                  - name = "casdoor-init-data"
                                }
                              - name      = "init-data"
                            },
                        ]
                      - image             = {
                          - name       = "casdoor"
                          - pullPolicy = "IfNotPresent"
                          - repository = "casbin"
                          - tag        = "v1.570.0"
                        }
                      - ingress           = {
                          - annotations = {
                              - "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
                            }
                          - className   = "traefik"
                          - enabled     = true
                          - hosts       = [
                              - {
                                  - host  = "sso.zitian.party"
                                  - paths = [
                                      - {
                                          - path     = "/"
                                          - pathType = "Prefix"
                                        },
                                    ]
                                },
                            ]
                          - tls         = [
                              - {
                                  - hosts      = [
                                      - "sso.zitian.party",
                                    ]
                                  - secretName = "casdoor-tls"
                                },
                            ]
                        }
                      - initContainers    = [
                          - {
                              - command = [
                                  - "sh",
                                  - "-c",
                                  - "timeout=120; elapsed=0; until nc -z postgresql.platform.svc.cluster.local 5432; do echo \"waiting for PostgreSQL... ($elapsed/$timeout s)\"; sleep 2; elapsed=$((elapsed+2)); if [ $elapsed -ge $timeout ]; then echo 'TIMEOUT: PostgreSQL not available'; exit 1; fi; done",
                                ]
                              - image   = "busybox:1.36"
                              - name    = "wait-for-postgres"
                            },
                        ]
                      - livenessProbe     = {
                          - failureThreshold = 3
                          - httpGet          = {
                              - path = "/"
                              - port = "http"
                            }
                          - periodSeconds    = 10
                        }
                      - readinessProbe    = {
                          - failureThreshold = 3
                          - httpGet          = {
                              - path = "/"
                              - port = "http"
                            }
                          - periodSeconds    = 10
                        }
                      - replicaCount      = 1
                      - resources         = {
                          - limits   = {
                              - cpu    = "500m"
                              - memory = "512Mi"
                            }
                          - requests = {
                              - cpu    = "100m"
                              - memory = "128Mi"
                            }
                        }
                      - service           = {
                          - port = 8000
                          - type = "ClusterIP"
                        }
                      - startupProbe      = {
                          - failureThreshold = 12
                          - httpGet          = {
                              - path = "/"
                              - port = "http"
                            }
                          - periodSeconds    = 10
                        }
                    }
                )
              - version        = "v1.570.0"
            },
        ] -> (known after apply)
        name                       = "casdoor"
      ~ values                     = [
          - (sensitive value),
          + (sensitive value),
        ]
        # (26 unchanged attributes hidden)
    }

  # kubernetes_config_map.casdoor_init_data[0] will be updated in-place
  ~ resource "kubernetes_config_map" "casdoor_init_data" {
      ~ data        = {
          ~ "init_data.json" = (sensitive value)
        }
        id          = "platform/casdoor-init-data"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_ingress_v1.vault will be destroyed
  # (because kubernetes_ingress_v1.vault is not in configuration)
  - resource "kubernetes_ingress_v1" "vault" {
      - id     = "platform/vault-ingress" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = ""
                              - ip       = "103.214.23.41"
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "cert-manager.io/cluster-issuer"                   = "letsencrypt-prod"
              - "traefik.ingress.kubernetes.io/router.middlewares" = "platform-portal-auth@kubernetescrd"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "vault-ingress" -> null
          - namespace        = "platform" -> null
          - resource_version = "806898" -> null
          - uid              = "ab81b193-a92e-4674-97a1-81eadd80a7b7" -> null
        }

      - spec {
          - ingress_class_name = "traefik" -> null

          - rule {
              - host = "secrets.zitian.party" -> null

              - http {
                  - path {
                      - path      = "/" -> null
                      - path_type = "Prefix" -> null

                      - backend {
                          - service {
                              - name = "vault" -> null

                              - port {
                                  - number = 8200 -> null
                                }
                            }
                        }
                    }
                }
            }

          - tls {
              - hosts       = [
                  - "secrets.zitian.party",
                ] -> null
              - secret_name = "vault-tls" -> null
            }
        }
    }

  # kubernetes_ingress_v1.vault_api will be created
  + resource "kubernetes_ingress_v1" "vault_api" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
            }
          + generation       = (known after apply)
          + name             = "vault-api-ingress"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "secrets.zitian.party"

              + http {
                  + path {
                      + path      = "/v1"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "vault"

                              + port {
                                  + number = 8200
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "secrets.zitian.party",
                ]
              + secret_name = "vault-tls"
            }
        }
    }

  # kubernetes_ingress_v1.vault_ui will be created
  + resource "kubernetes_ingress_v1" "vault_ui" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer"                   = "letsencrypt-prod"
              + "traefik.ingress.kubernetes.io/router.middlewares" = "platform-portal-auth@kubernetescrd"
            }
          + generation       = (known after apply)
          + name             = "vault-ui-ingress"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "secrets.zitian.party"

              + http {
                  + path {
                      + path      = "/ui"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "vault"

                              + port {
                                  + number = 8200
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/"
                      + path_type = "Exact"

                      + backend {
                          + service {
                              + name = "vault"

                              + port {
                                  + number = 8200
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "secrets.zitian.party",
                ]
              + secret_name = "vault-tls"
            }
        }
    }

  # random_bytes.l3_arangodb_jwt[0] will be created
  + resource "random_bytes" "l3_arangodb_jwt" {
      + base64 = (sensitive value)
      + hex    = (sensitive value)
      + length = 32
    }

  # random_password.l3_arangodb[0] will be created
  + resource "random_password" "l3_arangodb" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.l3_clickhouse[0] will be created
  + resource "random_password" "l3_clickhouse" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.l3_postgres has moved to random_password.l3_postgres[0]
    resource "random_password" "l3_postgres" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

  # random_password.l3_redis[0] will be created
  + resource "random_password" "l3_redis" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # restapi_object.casdoor_app_dashboard_oidc[0] will be created
  + resource "restapi_object" "casdoor_app_dashboard_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = (sensitive value)
      + id              = (known after apply)
      + id_attribute    = "data/name"
      + path            = (sensitive value)
      + update_path     = (sensitive value)
    }

  # restapi_object.casdoor_app_kubero_oidc[0] will be created
  + resource "restapi_object" "casdoor_app_kubero_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = (sensitive value)
      + id              = (known after apply)
      + id_attribute    = "data/name"
      + path            = (sensitive value)
      + update_path     = (sensitive value)
    }

  # restapi_object.casdoor_app_portal_gate[0] will be created
  + resource "restapi_object" "casdoor_app_portal_gate" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = (sensitive value)
      + id              = (known after apply)
      + id_attribute    = "data/name"
      + path            = (sensitive value)
      + update_path     = (sensitive value)
    }

  # restapi_object.casdoor_app_vault_oidc[0] will be created
  + resource "restapi_object" "casdoor_app_vault_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = (sensitive value)
      + id              = (known after apply)
      + id_attribute    = "data/name"
      + path            = (sensitive value)
      + update_path     = (sensitive value)
    }

  # restapi_object.casdoor_provider_github[0] will be created
  + resource "restapi_object" "casdoor_provider_github" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = (sensitive value)
      + id              = (known after apply)
      + id_attribute    = "data/name"
      + path            = (sensitive value)
      + update_path     = (sensitive value)
    }

Plan: 11 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + casdoor_api_info               = {
      + api_url   = "https://sso.zitian.party"
      + client_id = "admin"
      + note      = "Client secret is the same as casdoor_admin_password"
    }
  + casdoor_oidc_clients           = (sensitive value)
╷
│ Error: failed to lookup token, err=Error making API request.
│ 
│ URL: GET http://vault.platform.svc.cluster.local:8200/v1/auth/token/lookup-self
│ Code: 403. Errors:
│ 
│ * 2 errors occurred:
│ 	* permission denied
│ 	* invalid token
│ 
│ 
│ 
│   with vault_mount.kv[0],
│   on 6.vault-database.tf line 18, in resource "vault_mount" "kv":
│   18: resource "vault_mount" "kv" {
│ 
╵
╷
│ Error: failed to lookup token, err=Error making API request.
│ 
│ URL: GET http://vault.platform.svc.cluster.local:8200/v1/auth/token/lookup-self
│ Code: 403. Errors:
│ 
│ * 2 errors occurred:
│ 	* permission denied
│ 	* invalid token
│ 
│ 
│ 
│   with vault_mount.database[0],
│   on 6.vault-database.tf line 27, in resource "vault_mount" "database":
│   27: resource "vault_mount" "database" {
│ 
╵

```
</details>